Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementOnPhaseStatus},System.Boolean)
Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option
to match all elements that have a phase status other than the input statuses.
phaseId:
Id of the phase.
phaseStatuses:
Target statuses.
inverted:
True to match all phase statuses other than the input statuses.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementOnPhaseStatus})
Constructs a new instance of a file to match elements that have a given phase statuses on the input phase.
phaseId:
Id of the phase.
phaseStatuses:
Target statuses.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012